app/controllers/orders_controller.rb

  def index
    @orders = current_user.orders
---
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1  [["user_id", 215]]

  def show
    if current_user.nil?
      render file: "/public/404"
    elsif current_user == Order.find(params[:id]).user || current_user.admin?
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT 1  [["id", 131]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 347]]